# File          : cix-gnu-binutils.org
# Created       : <2015-11-02 Mon 22:18:23 GMT>
# Modified      : <2017-8-28 Mon 22:55:56 BST> sharlatan
# Author        : sharlatan
# Maintainer(s) :
# Sinopsis      : A GNU collection of binary utilities

#+OPTIONS: num:nil

[[file:../cix-main.org][|≣|]]
#+TITLE: GNU Bin Utils
|----------------+------------------|
| *Author*       | Alan Modra       |
| *Maintainer(s) |                  |
| *Released*     | 1991             |
| *Source*       | [[https://sourceware.org/git/gitweb.cgi?p=binutils-gdb.git][binutils-gdb.git]] |
| *Info*         |                  |
|----------------+------------------|

A set of programming tools for creating and managing binary programs, object
files, libraries, profile data, and assembly source code.
-----

**** objdump-161214215154
list required libraries for a package:
#+BEGIN_SRC sh
  #!/usr/bin/env bash

  PKG="binutils"

  # For dpkg based
  if command -v dpkg-query >/dev/null 2>&1; then
      for cmd in $(dpkg-query -L "$PKG" | grep "bin/"); do
          objdump -p "$cmd" | grep "NEEDED"
      done \
          | awk '{print $2}' | sort -u | sed 's/\..*$//g'

  elif command -v rpm >/dev/null 2>&1; then
      for cmd in $(rpm -ql "$PKG" | grep "bin/"); do
          objdump -p "$cmd" | grep "NEEDED"
      done \
          | awk '{print $2}' | sort -u | sed 's/\..*$//g'
  fi
#+END_SRC

#+RESULTS:
| ld-linux-x86-64 |
| libbfd-2        |
| libc            |
| libdl           |
| libm            |
| libopcodes-2    |

[[file:./cix-gnu-bash-builtin.org::*if][if]] [[file:./cix-gnu-bash-builtin.org::*for][for]] [[file:./cix-gnu-bash-builtin.org::*command][command]] [[file:./cix-gawk.org::*awk][awk (1)]] [[file:./cix-gnu-core-utilities.org::*sort][sort (1)]] [[file:./cix-sed.org::*sed][sed (1)]] [[file:./cix-gnu-grep.org::*grep][grep (1)]]
